Figure/Figure 3/data/kw_modified/system/controlDict



/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     pimpleFoam;

startFrom       latestTime; //startTime;

startTime       0;

stopAt          endTime;

endTime         24.3;

deltaT          0.0001;

writeControl    timeStep;

writeInterval   100;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

/*
libs
(
     "libforces.so"
);
*/

 functions
{

#includeFunc yPlus
#includeFunc wallShearStress
#includeFunc probesDict
///////////////////////////////////////////////////////////////////////////
   
    fieldAverage1
    {
        type            fieldAverage;
        libs            ("libfieldFunctionObjects.so");
    //   writeControl    writeTime;
        writeControl outputTime;
        fields
        (
            U
            {
                mean        on;
                prime2Mean  on;
                base        time;
            }
        );
    }

///////////////////////////////////////////////////////////////////////////
/*
    minmax_omega
    {
	type fieldMinMax;

	functionObjectLibs ("libfieldFunctionObjects.so");

	enabled true; 

	mode component;
    writeControl outputTime;

	log true;

	fields (omega);
    }

///////////////////////////////////////////////////////////////////////////
    minmax_k
    {
	type fieldMinMax;

	functionObjectLibs ("libfieldFunctionObjects.so");

	enabled true; 

	mode component;
    writeControl outputTime;

	log true;

	fields (k);
    }
*/
///////////////////////////////////////////////////////////////////////////
    
};

// ************************************************************************* //
