Figure/Figure 3/data/kw_modified/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    freeStream
    {
        type            symmetry;
        inGroups        1(symmetry);
        nFaces          20;
        startFace       6298;
    }
    bottomWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          20;
        startFace       6318;
    }
    left
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          162;
        startFace       6338;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  right;
    }
    right
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          162;
        startFace       6500;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  left;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          6480;
        startFace       6662;
    }
)

// ************************************************************************* //
